import pandas as pd
print(pd.__version__)

data = [
    ['삼성', '1000', '2000'],
    ['현대', '1100', '3000'],
    ['LG', '2000', '500'],
    ['아모레', '3500', '6000'],
    ['네이버', '100', '1500'],
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns) # 인덱스와 헤더는 데이터가 아님!!!
print(df)
#      종목명    시가    종가
# 031   삼성  1000  2000
# 059   현대  1100  3000
# 033   LG    2000   500
# 045  아모레  3500  6000
# 023  네이버   100  1500

print("================ 아모레와 네이버의 시가 ================")
print(df.iloc[4, 1])
print(df.loc['045', '시가'])
# 100
# 3500
print(df.iloc[4, 1], df.loc['045', '시가'])  # 100 3500

print(df.iloc[3:5])
#      종목명    시가    종가
# 045  아모레  3500  6000
print(df.iloc[3:5]['시가'])
# 045    3500
# 023     100
print(df.loc['045' :, '시가'])
# 045    3500
# 023     100
print(df.loc['045':]['시가'])
# 045    3500
# 023     100
print("================ 아모레와 네이버의 시가 ================")

# print(df.iloc[3:].loc['시가':])
#      종목명    시가    종가
# 045  아모레  3500  6000
# 023  네이버   100  1500
print(df.loc['033':].iloc[1:])
#      종목명    시가    종가
# 045  아모레  3500  6000
# 023  네이버   100  1500

