import pandas as pd
print(pd.__version__)

data = [
    ['삼성', '1000', '2000'],
    ['현대', '1100', '3000'],
    ['LG', '2000', '500'],
    ['아모레', '3500', '6000'],
    ['네이버', '100', '1500'],
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns) # 인덱스와 헤더는 데이터가 아님!!!
print(df)
#      종목명    시가    종가
# 031   삼성  1000  2000
# 059   현대  1100  3000
# 033   LG    2000   500
# 045  아모레  3500  6000
# 023  네이버   100  1500


print("=====================================================")
print("시가가 1000원 이상인 행을 모두 출력!!")
a = 1000
b = df.loc[:'023']['시가']
c = []
for i in b:
    # print(i)
    if int(i) >= a:          # int(i)
        c.append(i)
print(c)
# ['1000', '1100', '2000', '3500']


# cond1 = df['시가'] >= 1100
# print(df[cond1])
# print(df[df['시가'] >= '1100'])

print("=====================================================")
print(df.loc[df['시가'] >= '1100'])
#      종목명    시가    종가
# 059   현대  1100  3000
# 033   LG  2000   500
# 045  아모레  3500  6000

########## 위에서 종가만 뽑고싶어. ##########
df3 = df[df['시가'] >= '1100']['종가']
# df3 = df.loc[df['시가'] >= '1100']['종가']
print(df3)
# 059    3000
# 033     500
# 045    6000

